Repository: fifty-six/Scarab
Catalog: Scarab/Resources.*.resx
Languages: fr, hu_hu, pt_br, zh

# MI_InstallText_Installed
source: Uninstall
fr: Désinstaller
hu_hu: Eltávolít
pt_br: Desinstalar
zh: 卸载

# MI_InstallText_NotInstalled
source: Install
fr: Installer
hu_hu: Telepítés
pt_br: Instalar
zh: 安装

# MLVM_ApiButtonText_DisableAPI
source: Disable API
fr: Désactiver l'API
hu_hu: API ki
pt_br: Desativar API
zh: 禁用API

# MLVM_ApiButtonText_EnableAPI
source: Enable API
fr: Activer l'API
hu_hu: API be
pt_br: Ativar API
zh: 启用API

# MLVM_ApiButtonText_ToggleAPI
source: Toggle API
fr: Activer l'API
hu_hu: API ki/be
pt_br: Ativar/Desativar API
zh: 切换API

# MLVM_ChangePathAsync_Msgbox_Text
source: Re-open the installer to use your new path.
fr: Relancer le programme pour utiliser le nouveau chemin.
hu_hu: Indítsd újra a telepítőt az új útvonal használatához.
pt_br: Reabra o Scarab para aplicar seu novo caminho.
zh: 请重新启动Scarab以应用更改

# MLVM_ChangePathAsync_Msgbox_Title
source: Path Changed!
fr: Chemin changé !
hu_hu: Az útvonal megváltozott!
pt_br: Caminho Alterado!
zh: 游戏路径已更改

# MLVM_DisplayHashMismatch_Msgbox_Text
source: The download hash for {0} ({1}) didn't match the given signature ({2}). It is either corrupt or the entry is incorrect.
fr: Le hachage pour {0} ({1}) ne correspond pas à la signature ({2}). Il est corrompu ou bien la valeur est incorrecte.
hu_hu: A {0} letöltési hash-e ({1}) nem egyezik a megadottal ({2}). Korruptálódhatott, vagy a bejegyzés helytelen.
pt_br: O hash da transferência de {0} ({1}) não correspondeu com a assinatura concedida ({2}). Ele está corrompido ou o registro está incorreto.
zh: {0}({1}) 的哈希值与给定的哈希值{2}不匹配，它已损坏。

# MLVM_DisplayHashMismatch_Msgbox_Title
source: Hash mismatch!
fr: Les hachages diffèrent !
hu_hu: Eltérő hash-ek
pt_br: Discrepância de hash!
zh: 哈希值不匹配

# MLVM_DisplayNetworkError_Msgbox_Text
source: Unable to download {0}! The site may be down or you may lack network connectivity.
fr: Impossible de télécharger {0} ! Le site est hors-ligne ou a des problèmes de connexion.
hu_hu: Nem lehet letölteni a következőt: {0}. Az oldalnál működési hiba léphetett fel, vagy nálad lehet hálózati probléma.
pt_br: Impossível baixar {0}! O site pode estar fora do ar ou você não possui conexão de rede.
zh: 无法下载{0}！资源可能已删除，或者未连接网络

# MLVM_DisplayNetworkError_Msgbox_Title
source: Network Error
fr: Erreur de réseau
hu_hu: Hálózati hiba
pt_br: Erro de Rede
zh: 网络错误

# MLVM_InternalUpdateInstallAsync_Msgbox_W_Text
source: Hollow Knight is open! This may lead to issues when installing mods. Close Hollow Knight?
fr: Hollow Knight est ouvert ! Cela peut occasionner des problèmes en installant des mods. Fermer Hollow Knight ?
hu_hu: A Hollow Knight épp fut. Ez problémát okozhat modok telepítésekor. Ki akarsz lépni belőle?
pt_br: Hollow Knight está aberto! Isto pode acarretar em problemas ao instalar mods. Deseja fechar o Hollow Knight?
zh: 游戏正在运行，这可能会导致一些问题。是否关闭游戏？

# MLVM_InternalUpdateInstallAsync_Msgbox_W_Title
source: Warning!
fr: Alerte !
hu_hu: Figyelem!
pt_br: Aviso!
zh: 警告

# MWVM_Impl_Error_Fetch_ModLinks_Error
source: failed with HTTP error {0}
fr: a échoué avec le code d'erreur HTTP {0}
hu_hu: meghíúsult a következő HTTP hibakóddal: {0}
pt_br: falhou com erro HTTP {0}
zh: HTTP错误{0}

# MWVM_Impl_Error_Fetch_ModLinks_Msgbox_Text
source: Unable to fetch modlinks, the operation {0}
fr: Impossible de récupérer la liste des mods depuis modlinks : {0}
hu_hu: A modlinks lekérése sikertelen. A művelet {0}
pt_br: Impossível obter o modlinks, a operação {0}
zh: 无法获取ModLinks，原因：{0}

# MWVM_Impl_Error_Fetch_ModLinks_Msgbox_Title
source: Error!
fr: Erreur !
hu_hu: Hiba!
pt_br: Erro!
zh: 错误

# MWVM_Impl_Error_Fetch_ModLinks_Timeout
source: timed out
fr: délai dépassé
hu_hu: túllépte a megengedett időkeretet
pt_br: excedeu o tempo limite
zh: 超时

# MWVM_OutOfDate_GetLatest
source: Get the latest release
fr: Récupérer la dernière version
hu_hu: Legfrissebb kiadás beszerzése
pt_br: Obter a última versão
zh: 获取最新的版本

# MWVM_OutOfDate_ContinueAnyways
source: Continue anyways.
fr: Continuer quand même.
hu_hu: Folytatás mindenképpen
pt_br: Continuar mesmo assim.
zh: 继续

# MWVM_OutOfDate_Title
source: Out of date!
fr: Périmé!
hu_hu: Elavult verzió
pt_br: Desatualizado!
zh: 过时了

# MWVM_OutOfDate_Message
source: This program is out of date! It may not function correctly.
fr: Ce programme est périmé ! Il peut ne pas fonctionner correctement.
hu_hu: A program elavult. Bizonyos funkciók nem biztos, hogy megfelelően működnek.
pt_br: Este programa está desatualizado! Ele pode não funcionar corretamente.
zh: 这个程序已经过时了！它可能无法正常工作。

# MWVM_Warning
source: Warning
fr: Alerte
hu_hu: Figyelmeztetés
pt_br: Aviso
zh: 警告

# MWVM_InvalidSavedPath_Message
source: The saved Hollow Knight path is invalid, please re-select a valid path. If this is unexpected, verify your game files.
fr: Le chemin de sauvegardes de Hollow Knight est invalide, merci de choisir un chemin valide.
hu_hu: Az elmentett Hollow Knight útvonal érvénytelen. Kérlek, adj meg egy létező útvonalat!
pt_br: O caminho salvo do Hollow Knight é inválido. Por favor, selecione novamente um caminho válido.
zh: 空洞骑士的路径无效，请重新选择有效路径。

# MWVM_Info
source: Info
fr: Information
hu_hu: Infó
zh: 信息

# MWVM_UnableToDetect_Message
source: Unable to detect your Hollow Knight installation. Please select it.
fr: Impossible de trouver le dossier d'installation de Hollow Knight. Veuillez le sélectionner.
hu_hu: A Hollow Knight telepítés észlelése sikertelen. Kérlek, add meg!
pt_br: Não foi possível detectar a sua instalação do Hollow Knight. Por favor, selecione-a.
zh: 无法检测到空洞骑士的路径，请手动选择它。

# MWVM_DetectedPath_Title
source: Detected path!
fr: Chemin trouvé !
hu_hu: Telepítés észlelve
pt_br: Caminho detectado!
zh: 检测到的路径！

# MWVM_DetectedPath_Message
source: Detected Hollow Knight install at {0}. Is this correct?
fr: Dossier d'installation de Hollow Knight trouvé vers {0}. Est-ce correct ?
hu_hu: Hollow Knight telepítés észlelve itt: {0}. Helyes az útvonal?
pt_br: Detectada uma instalação do Hollow Knight em {0}. Isto está correto?
zh: 检测到空洞骑士的路径为{0}。这是对的吗？

# XAML_ChangPath
source: Change Path
fr: Changer le chemin
hu_hu: HK mappa módosítása...
pt_br: Alterar Caminho
zh: 更改游戏目录

# XAML_Dependencies
source: Dependencies
fr: \nDépendances :\n
hu_hu: Függőségek:
pt_br: Dependências
zh: 依赖Mods

# XAML_Donate
source: Donate
fr: Donation
hu_hu: Támogatás
pt_br: Doar
zh: 捐赠

# XAML_ModsFilter_All
source: All
fr: Tous
hu_hu: Mind
pt_br: Todos
zh: 所有Mods

# XAML_ModsFilter_Enabled
source: Enabled
fr: Actifs
hu_hu: Engedélyezett
pt_br: Ativos
zh: 已启用

# XAML_ModsFilter_Installed
source: Installed
fr: Installés
hu_hu: Telepített
pt_br: Instalados
zh: 已安装

# XAML_ModsFilter_OutOfDate
source: Out of date
fr: Périmés
hu_hu: Elavult
pt_br: Desatualizados
zh: 已过时

# XAML_OpenMods
source: Open Mods
fr: Ouvrir le dossier des mods
hu_hu: Mods mappa...
pt_br: Abrir Mods
zh: 打开Mods文件夹

# XAML_Repository
source: Repository:
fr: \nDépôts :\n
hu_hu: Forráskód:
pt_br: Repositório:
zh: 代码仓库：

# XAML_SearchMark
source: Mod Search
fr: Chercher des mods...
hu_hu: Keresés
pt_br: Pesquisar Mod
zh: 搜索Mod

# XAML_UpdateAPI
source: Update API
fr: Mettre l'API à jour
hu_hu: API frissítése
pt_br: Atualizar API
zh: 更新API

# XAML_Version
source: Version:
fr: \nVersion :\n
hu_hu: Verzió:
pt_br: Versão:
zh: 版本：

# XAML_Integrations
source: Integrations
fr: Intégrations
hu_hu: Integrációk
pt_br: Integrações
zh: 整合

# XAML_Tags
source: Tags
hu_hu: Címkék
pt_br: Etiquetas
zh: 标签

# XAML_On
source: On
hu_hu: Be
pt_br: Ativado
zh: 启用

# XAML_Off
source: Off
hu_hu: Ki
pt_br: Desativado
zh: 禁用

# XAML_Update
source: Update
fr: Mettre à jour
hu_hu: Frissítés
pt_br: Atualizar
zh: 更新

# PU_NoSelect
source: No path was selected!
fr: Aucun chemin sélectionné !
hu_hu: Nincs útvonal kiválasztva!
pt_br: Nenhum caminho foi selecionado!
zh: 未选择路径！

# PU_NoSelectMac
source: No application was selected!
fr: Aucune application sélectionnée !
hu_hu: Nincs alkalmazás kiválasztva!
pt_br: Nenhuma aplicação foi selecionada!
zh: 未选择任何应用程序！

# PU_InvalidPathHeader
source: Invalid Hollow Knight path!
fr: Le chemin de Hollow Knight est invalide !
hu_hu: Érvénytelen Hollow Knight útvonal!
pt_br: Caminho do Hollow Knight inválido!
zh: 无效的空洞骑士路径

# PU_InvalidAppHeader
source: Invalid Hollow Knight app!
fr: L'application Hollow Knight est invalide !
hu_hu: Érvénytelen Hollow Knight alkalmazás!
pt_br: Aplicativo do Hollow Knight inválido!
zh: 无效的空洞骑士路径

# PU_InvalidPath
source: Select the folder containing hollow_knight_Data or Hollow Knight_Data.
fr: Sélectionnez le dossier contenant hollow_knight_Data ou Hollow Knight_Data.
hu_hu: Add meg a hollow_knight_data vagy Hollow Knight_Data mappát tartalmazó könyvtárat.
pt_br: Selecione a pasta que contém hollow_knight_Data ou Hollow Knight_Data.
zh: 选择包含“hollow_knight_Data”或“Hollow Knight_Data”的文件夹。

# PU_InvalidApp
source: Missing Managed folder or Assembly-CSharp!
fr: Dossier Managed ou Assembly-CSharp non trouvé !
hu_hu: Hiányzó Managed mappa, vagy Assembly-CSharp!
pt_br: A pasta Managed ou o Assembly-CSharp está ausente!
zh: 缺少Managed或Assembly-CSharp.dll

# PU_SelectPath
source: Select your Hollow Knight {0}.
fr: Sélectionner le dossier de Hollow Knight.
hu_hu: Add meg a Hollow Knight {0}!
pt_br: Selecione a sua {0} do Hollow Knight.
zh: 选择你的空洞骑士 {0}

# PU_InvalidPathTitle
source: Path
fr: Chemin
hu_hu: Útvonal
pt_br: Caminho
zh: 路径

# PU_SelectApp
source: Select your Hollow Knight app.
fr: Sélectionnez l'application Hollow Knight.
hu_hu: Add meg a Hollow Knight alkalmazást!
pt_br: Selecione o seu app do Hollow Knight.
zh: 选择空洞骑士

# XAML_ModsFilter_OutOfDate_Update
source: Update All
fr: Tout mettre à jour
hu_hu: Mindet frissít
pt_br: Atualizar Tudo
zh: 全部更新

# NOTIFY_Installed
source: Installed
hu_hu: Telepítve

# NOTIFY_Updated
source: Updated
hu_hu: Frissítve

# NOTIFY_Uninstalled
source: Uninstalled
hu_hu: Eltávolítva
